In [1]:
import pandas as pd

In [2]:
url = 'https://en.wikipedia.org/wiki/1976_Summer_Olympics_medal_table'

In [3]:
data = pd.read_html(url)[0]

In [4]:
data.head()

      0                    1     2       3       4      5
0  Rank                  NOC  Gold  Silver  Bronze  Total
1     1   Soviet Union (URS)    49      41      35    125
2     2   East Germany (GDR)    40      25      25     90
3     3  United States (USA)    34      35      25     94
4     4   West Germany (FRG)    10      12      17     39

In [5]:
type(data)

pandas.core.frame.DataFrame

In [6]:
len(data)

43

In [7]:
data.tail()

                    0    1    2    3    4    5
38      Bermuda (BER)    0    0    1    1  NaN
39     Pakistan (PAK)    0    0    1    1  NaN
40  Puerto Rico (PUR)    0    0    1    1  NaN
41     Thailand (THA)    0    0    1    1  NaN
42   Totals (41 NOCs)  198  199  216  613  NaN

In [8]:
data.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [9]:
data.columns = ['Rank','NOC','Gold','Silver','Bronze','Total']

In [10]:
data.tail()

                 Rank  NOC Gold Silver Bronze Total
38      Bermuda (BER)    0    0      1      1   NaN
39     Pakistan (PAK)    0    0      1      1   NaN
40  Puerto Rico (PUR)    0    0      1      1   NaN
41     Thailand (THA)    0    0      1      1   NaN
42   Totals (41 NOCs)  198  199    216    613   NaN

In [11]:
data.head()

   Rank                  NOC  Gold  Silver  Bronze  Total
0  Rank                  NOC  Gold  Silver  Bronze  Total
1     1   Soviet Union (URS)    49      41      35    125
2     2   East Germany (GDR)    40      25      25     90
3     3  United States (USA)    34      35      25     94
4     4   West Germany (FRG)    10      12      17     39

In [12]:
data.drop([0],inplace=True)

In [13]:
data.head()

  Rank                  NOC Gold Silver Bronze Total
1    1   Soviet Union (URS)   49     41     35   125
2    2   East Germany (GDR)   40     25     25    90
3    3  United States (USA)   34     35     25    94
4    4   West Germany (FRG)   10     12     17    39
5    5          Japan (JPN)    9      6     10    25

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 42 entries, 1 to 42
Data columns (total 6 columns):
Rank      42 non-null object
NOC       42 non-null object
Gold      42 non-null object
Silver    42 non-null object
Bronze    42 non-null object
Total     33 non-null object
dtypes: object(6)
memory usage: 2.3+ KB

In [15]:
data.to_csv('Medal.csv',index=False)

In [16]:
data2 = pd.read_csv('Medal.csv')

In [17]:
data.head()

  Rank                  NOC Gold Silver Bronze Total
1    1   Soviet Union (URS)   49     41     35   125
2    2   East Germany (GDR)   40     25     25    90
3    3  United States (USA)   34     35     25    94
4    4   West Germany (FRG)   10     12     17    39
5    5          Japan (JPN)    9      6     10    25